
## Plan Result (koyashiro.me)

[CI link](https://github.com/koyashiro/infra/actions/runs/8789031075)


<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.cname_root
  * cloudflare_record.txt_dkim
  * cloudflare_record.txt_dmarc
  * cloudflare_record.txt_keybase_site_verification
  * cloudflare_record.txt_spf


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.cname_root will be created
  + resource "cloudflare_record" "cname_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "koyashi.ro"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_dkim will be created
  + resource "cloudflare_record" "txt_dkim" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "*._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DKIM1; p="
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_dmarc will be created
  + resource "cloudflare_record" "txt_dmarc" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s;"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_keybase_site_verification will be created
  + resource "cloudflare_record" "txt_keybase_site_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "keybase-site-verification=mXW1Jxxi9Cxm_w4TvEv1g3eFJVpm95-i0VCWsxSmr8M"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_spf will be created
  + resource "cloudflare_record" "txt_spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=spf1 -all"
      + zone_id         = (sensitive value)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":167,"Program":"tfcmt","SHA1":"15ecb5552d61a139e0c8a0dafd4c5b28baaf3245","Target":"koyashiro.me","Vars":{},"WorkflowName":"terraform"} -->